[
    {
      "date": "January 2024 - Present",
      "position": "Software Engineering 1",
      "company": "Babel Street",
      "shortDescription": "Currently working on fast multi-label topic categorization, and a lot of containerization."
    },
    {
      "date": "January 2023 - August 2023",
      "position": "Software Engineering Co-op",
      "company": "Babel Street",
      "shortDescription": "I developed an optimized search and filtering tool for Rosette Adaptation Studio's front page, utilizing MongoDB, Flask, and ReactJS. Additionally, I proactively maintained the company's event extraction service through FastAPI, including issuing pre-releases, improving functionality, and conducting rigorous testing. I also innovated by creating an event extraction reporting tool with ReactJS and Flask, offering enhanced transparency into event extraction model behavior to provide project managers with deeper insights for informed decision-making. Throughout these tasks, I collaborated closely with Project Managers and the QA team to drive continuous improvement within the product.",
      "imageLink": "https://www.securityandpolicing.co.uk/wp-content/uploads/sites/16/exhibitors/twenty-thr/images/137622-300x300.png"
    },
    {
      "date": "January 2022 - August 2022",
      "position": "Software Engineering Co-op",
      "company": "Wellframe",
      "shortDescription": "I led an initiative to enable the execution of API tests on over 70 different personal environments, both locally and through our CI/CD pipeline, using Java, Maven, and BASH. This effort resulted in a remarkable 90% reduction in test failures and ensured a synchronized testing environment. Additionally, I conducted testing on more than 40 internal and external endpoints across all four REST API services within the company, identifying and reporting multiple bugs. I utilized tools like Cucumber, JUnit, Postman, cURL, and Postico for this task. Furthermore, I implemented a nightly CI/CD pipeline that runs a script to keep all environments up-to-date with the latest services, saving valuable time for the entire automation team.",
      "imageLink": "https://thebestandbrightest.com/wp-content/uploads/2021/05/wellframe_logo.png"
    },
    {
        "date": "September 2021 - December 2023",
        "position": "Lead Teaching Assistant",
        "company": "Khoury College of Computer Science",
        "shortDescription": "As the Lead Teaching Assistant for Fundies 1, the introductory course for all new CS majors at Northeastern, I took on various responsibilities, including conducting and overseeing lab sessions, offering extensive office hours, and meticulously grading assignments.",
        "imageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Northeastern_seal.svg/1200px-Northeastern_seal.svg.png"
      }
  ]